colosimo/kim-os/arch/arm/cpu-cortex-m0/soc-lpc111x/include/reg.h
/*
 * Author: Aurelio Colosimo, 2016
 *
 * This file is part of kim-os project: https://github.com/colosimo/kim-os
 * According to kim-os license, you can do whatever you want with it,
 * as long as you retain this notice.
 */

#ifndef _REG_H_
#define _REG_H_

/* I/O Configuration (IOCON) */
#define R_IOCON_PIO2_6    reg32(0x40044000)
#define R_IOCON_PIO2_0    reg32(0x40044008)
#define R_IOCON_PIO0_0    reg32(0x4004400C)
#define R_IOCON_PIO0_1    reg32(0x40044010)
#define R_IOCON_PIO1_8    reg32(0x40044014)
#define R_IOCON_PIO0_2    reg32(0x4004401C)
#define R_IOCON_PIO2_7    reg32(0x40044020)
#define R_IOCON_PIO2_8    reg32(0x40044024)
#define R_IOCON_PIO2_1    reg32(0x40044028)
#define R_IOCON_PIO0_3    reg32(0x4004402C)
#define R_IOCON_PIO0_4    reg32(0x40044030)
#define R_IOCON_PIO0_5    reg32(0x40044034)
#define R_IOCON_PIO1_9    reg32(0x40044038)
#define R_IOCON_PIO3_4    reg32(0x4004403C)
#define R_IOCON_PIO2_4    reg32(0x40044040)
#define R_IOCON_PIO2_5    reg32(0x40044044)
#define R_IOCON_PIO3_5    reg32(0x40044048)
#define R_IOCON_PIO0_6    reg32(0x4004404C)
#define R_IOCON_PIO0_7    reg32(0x40044050)
#define R_IOCON_PIO2_9    reg32(0x40044054)
#define R_IOCON_PIO2_10   reg32(0x40044058)
#define R_IOCON_PIO2_2    reg32(0x4004405C)
#define R_IOCON_PIO0_8    reg32(0x40044060)
#define R_IOCON_PIO0_9    reg32(0x40044064)
#define R_IOCON_PIO0_10   reg32(0x40044068)
#define R_IOCON_PIO1_10   reg32(0x4004406C)
#define R_IOCON_PIO2_11   reg32(0x40044070)
#define R_IOCON_PIO0_11   reg32(0x40044074)
#define R_IOCON_PIO1_0    reg32(0x40044078)
#define R_IOCON_PIO1_1    reg32(0x4004407C)
#define R_IOCON_PIO1_2    reg32(0x40044080)
#define R_IOCON_PIO3_0    reg32(0x40044084)
#define R_IOCON_PIO3_1    reg32(0x40044088)
#define R_IOCON_PIO2_3    reg32(0x4004408C)
#define R_IOCON_PIO1_3    reg32(0x40044090)
#define R_IOCON_PIO1_4    reg32(0x40044094)
#define R_IOCON_PIO1_11   reg32(0x40044098)
#define R_IOCON_PIO3_2    reg32(0x4004409C)
#define R_IOCON_PIO1_5    reg32(0x400440A0)
#define R_IOCON_PIO1_6    reg32(0x400440A4)
#define R_IOCON_PIO1_7    reg32(0x400440A8)
#define R_IOCON_PIO3_3    reg32(0x400440AC)
#define R_IOCON_SCK_LOC   reg32(0x400440B0)
#define R_IOCON_DSR_LOC   reg32(0x400440B4)
#define R_IOCON_DCD_LOC   reg32(0x400440B8)
#define R_IOCON_RI_LOC    reg32(0x400440BC)

/* System Configuration (SYSCON) */
#define R_SYSMEMREMAP     reg32(0x40048000)
#define R_PRESETCTRL      reg32(0x40048004)
#define R_SYSPLLCTRL      reg32(0x40048008)
#define R_SYSPLLSTAT      reg32(0x4004800C)
#define R_SYSOSCCTRL      reg32(0x40048020)
#define R_WDTOSCCTRL      reg32(0x40048024)
#define R_IRCCTRL         reg32(0x40048028)
#define R_SYSRSTSTAT      reg32(0x40048030)
#define R_SYSPLLCLKSEL    reg32(0x40048040)
#define R_SYSPLLCLKUEN    reg32(0x40048044)
#define R_MAINCLKSEL      reg32(0x40048070)
#define R_MAINCLKUEN      reg32(0x40048074)
#define R_SYSAHBCLKDIV    reg32(0x40048078)
#define R_SYSAHBCLKCTRL   reg32(0x40048080)
#define R_SSP0CLKDIV      reg32(0x40048094)
#define R_UARTCLKDIV      reg32(0x40048098)
#define R_SSP1CLKDIV      reg32(0x4004809C)
#define R_WDTCLKSEL       reg32(0x400480D0)
#define R_WDTCLKUEN       reg32(0x400480D4)
#define R_WDTCLKDIV       reg32(0x400480D8)
#define R_CLCKOUTCLKSEL   reg32(0x400480E0)
#define R_CLCKOUTUEN      reg32(0x400480E4)
#define R_CLCKOUTCLKDIV   reg32(0x400480E8)
#define R_PIOPORCAP0      reg32(0x40048100)
#define R_PIOPORCAP1      reg32(0x40048104)
#define R_BODCTRL         reg32(0x40048150)
#define R_SYSTCKCAL       reg32(0x40048154)
#define R_IRQLATENCY      reg32(0x40048170)
#define R_NMISRC          reg32(0x40048174)
#define R_STARTAPRP0      reg32(0x40048200)
#define R_STARTERP0       reg32(0x40048204)
#define R_STARTRSRP0CLR   reg32(0x40048208)
#define R_STARTSRP0       reg32(0x4004820C)
#define R_PDSLEEPCFG      reg32(0x40048230)
#define R_PDAWAKECFG      reg32(0x40048234)
#define R_PDRUNCFG        reg32(0x40048238)
#define R_DEVICE_ID       reg32(0x400483F4)

/* UART */
#define R_U0RBR           reg32(0x40008000)
#define R_U0THR           reg32(0x40008000)
#define R_U0DLL           reg32(0x40008000)
#define R_U0DLM           reg32(0x40008004)
#define R_U0IER           reg32(0x40008004)
#define R_U0IIR           reg32(0x40008008)
#define R_U0FCR           reg32(0x40008008)
#define R_U0LCR           reg32(0x4000800C)
#define R_U0MCR           reg32(0x40008010)
#define R_U0LSR           reg32(0x40008014)
#define R_U0MSR           reg32(0x40008018)
#define R_U0SCR           reg32(0x4000801C)
#define R_U0ACR           reg32(0x40008020)
#define R_U0FDR           reg32(0x40008028)
#define R_U0TER           reg32(0x40008030)
#define R_U0RS485CTRL     reg32(0x4000804C)
#define R_U0RS485ADRMATCH reg32(0x40008050)
#define R_U0RS485DLY      reg32(0x40008054)

/* CT16B0 */
#define R_TMR16B0IR       reg32(0x4000C000)
#define R_TMR16B0TCR      reg32(0x4000C004)
#define R_TMR16B0TC       reg32(0x4000C008)
#define R_TMR16B0PR       reg32(0x4000C00C)
#define R_TMR16B0PC       reg32(0x4000C010)
#define R_TMR16B0MCR      reg32(0x4000C014)
#define R_TMR16B0MR0      reg32(0x4000C018)
#define R_TMR16B0MR1      reg32(0x4000C01C)
#define R_TMR16B0MR2      reg32(0x4000C020)
#define R_TMR16B0MR3      reg32(0x4000C024)
#define R_TMR16B0CCR      reg32(0x4000C028)
#define R_TMR16B0CR0      reg32(0x4000C02C)
#define R_TMR16B0CR1      reg32(0x4000C030)
#define R_TMR16B0EMR      reg32(0x4000C03C)
#define R_TMR16B0CTCR     reg32(0x4000C070)
#define R_TMR16B0PWMC     reg32(0x4000C074)

/* CT16B1 */
#define R_TMR16B1IR       reg32(0x40010000)
#define R_TMR16B1TCR      reg32(0x40010004)
#define R_TMR16B1TC       reg32(0x40010008)
#define R_TMR16B1PR       reg32(0x4001000C)
#define R_TMR16B1PC       reg32(0x40010010)
#define R_TMR16B1MCR      reg32(0x40010014)
#define R_TMR16B1MR0      reg32(0x40010018)
#define R_TMR16B1MR1      reg32(0x4001001C)
#define R_TMR16B1MR2      reg32(0x40010020)
#define R_TMR16B1MR3      reg32(0x40010024)
#define R_TMR16B1CCR      reg32(0x40010028)
#define R_TMR16B1CR0      reg32(0x4001002C)
#define R_TMR16B1CR1      reg32(0x40010030)
#define R_TMR16B1EMR      reg32(0x4001003C)
#define R_TMR16B1CTCR     reg32(0x40010070)
#define R_TMR16B1PWMC     reg32(0x40010074)

/* CT32B0 */
#define R_TMR32B0IR       reg32(0x40014000)
#define R_TMR32B0TCR      reg32(0x40014004)
#define R_TMR32B0TC       reg32(0x40014008)
#define R_TMR32B0PR       reg32(0x4001400C)
#define R_TMR32B0PC       reg32(0x40014010)
#define R_TMR32B0MCR      reg32(0x40014014)
#define R_TMR32B0MR0      reg32(0x40014018)
#define R_TMR32B0MR1      reg32(0x4001401C)
#define R_TMR32B0MR2      reg32(0x40014020)
#define R_TMR32B0MR3      reg32(0x40014024)
#define R_TMR32B0CCR      reg32(0x40014028)
#define R_TMR32B0CR0      reg32(0x4001402C)
#define R_TMR32B0EMR      reg32(0x4001403C)
#define R_TMR32B0CTCR     reg32(0x40014070)
#define R_TMR32B0PWMC     reg32(0x40014074)

/* CT32B1 */
#define R_TMR32B1IR       reg32(0x40018000)
#define R_TMR32B1TCR      reg32(0x40018004)
#define R_TMR32B1TC       reg32(0x40018008)
#define R_TMR32B1PR       reg32(0x4001800C)
#define R_TMR32B1PC       reg32(0x40018010)
#define R_TMR32B1MCR      reg32(0x40018014)
#define R_TMR32B1MR0      reg32(0x40018018)
#define R_TMR32B1MR1      reg32(0x4001801C)
#define R_TMR32B1MR2      reg32(0x40018020)
#define R_TMR32B1MR3      reg32(0x40018024)
#define R_TMR32B1CCR      reg32(0x40018028)
#define R_TMR32B1CR0      reg32(0x4001802C)
#define R_TMR32B1EMR      reg32(0x4001803C)
#define R_TMR32B1CTCR     reg32(0x40018070)
#define R_TMR32B1PWMC     reg32(0x40018074)

/* ADC */
#define R_AD0CR           reg32(0x4001C000)
#define R_AD0GDR          reg32(0x4001C004)
#define R_AD0INTEN        reg32(0x4001C00C)
#define R_AD0DR0          reg32(0x4001C010)
#define R_AD0DR1          reg32(0x4001C014)
#define R_AD0DR2          reg32(0x4001C018)
#define R_AD0DR3          reg32(0x4001C01C)
#define R_AD0DR4          reg32(0x4001C020)
#define R_AD0DR5          reg32(0x4001C024)
#define R_AD0DR6          reg32(0x4001C028)
#define R_AD0DR7          reg32(0x4001C02C)
#define R_AD0STAT         reg32(0x4001C030)

/* SPI0 */
#define R_SSP0CR0         reg32(0x40040000)
#define R_SSP0CR1         reg32(0x40040004)
#define R_SSP0DR          reg32(0x40040008)
#define R_SSP0SR          reg32(0x4004000C)
#define R_SSP0CPSR        reg32(0x40040010)
#define R_SSP0IMSC        reg32(0x40040014)
#define R_SSP0RIS         reg32(0x40040018)
#define R_SSP0MIS         reg32(0x4004001C)
#define R_SSP0ICR         reg32(0x40040020)

/* GPIO Port n generic macros*/
#define R_GPIODATAMSK(n)  reg32(0x50000000 + 0x10000 * n)
#define R_GPIODATA(n)     reg32(0x50003FFC + 0x10000 * n)
#define R_GPIODIR(n)      reg32(0x50008000 + 0x10000 * n)
#define R_GPIOIS(n)       reg32(0x50008004 + 0x10000 * n)
#define R_GPIOIBE(n)      reg32(0x50008008 + 0x10000 * n)
#define R_GPIOIEV(n)      reg32(0x5000800C + 0x10000 * n)
#define R_GPIOIE(n)       reg32(0x50008010 + 0x10000 * n)
#define R_GPIORIS(n)      reg32(0x50008014 + 0x10000 * n)
#define R_GPIOMIS(n)      reg32(0x50008018 + 0x10000 * n)
#define R_GPIOIC(n)       reg32(0x5000801C + 0x10000 * n)

/* GPIO Port 0 */
#define R_GPIO0DATAMSK    reg32(0x50000000)
#define R_GPIO0DATA       reg32(0x50003FFC)
#define R_GPIO0DIR        reg32(0x50008000)
#define R_GPIO0IS         reg32(0x50008004)
#define R_GPIO0IBE        reg32(0x50008008)
#define R_GPIO0IEV        reg32(0x5000800C)
#define R_GPIO0IE         reg32(0x50008010)
#define R_GPIO0RIS        reg32(0x50008014)
#define R_GPIO0MIS        reg32(0x50008018)
#define R_GPIO0IC         reg32(0x5000801C)

/* GPIO Port 1 */
#define R_GPIO1DATAMSK    reg32(0x50010000)
#define R_GPIO1DATA       reg32(0x50013FFC)
#define R_GPIO1DIR        reg32(0x50018000)
#define R_GPIO1IS         reg32(0x50018004)
#define R_GPIO1IBE        reg32(0x50018008)
#define R_GPIO1IEV        reg32(0x5001800C)
#define R_GPIO1IE         reg32(0x50018010)
#define R_GPIO1RIS        reg32(0x50018014)
#define R_GPIO1MIS        reg32(0x50018018)
#define R_GPIO1IC         reg32(0x5001801C)

/* GPIO Port 2 */
#define R_GPIO2DATAMSK    reg32(0x50020000)
#define R_GPIO2DATA       reg32(0x50023FFC)
#define R_GPIO2DIR        reg32(0x50028000)
#define R_GPIO2IS         reg32(0x50028004)
#define R_GPIO2IBE        reg32(0x50028008)
#define R_GPIO2IEV        reg32(0x5002800C)
#define R_GPIO2IE         reg32(0x50028010)
#define R_GPIO2RIS        reg32(0x50028014)
#define R_GPIO2MIS        reg32(0x50028018)
#define R_GPIO2IC         reg32(0x5002801C)

/* GPIO Port 3 */
#define R_GPIO3DATAMSK    reg32(0x50030000)
#define R_GPIO3DATA       reg32(0x50033FFC)
#define R_GPIO3DIR        reg32(0x50038000)
#define R_GPIO3IS         reg32(0x50038004)
#define R_GPIO3IBE        reg32(0x50038008)
#define R_GPIO3IEV        reg32(0x5003800C)
#define R_GPIO3IE         reg32(0x50038010)
#define R_GPIO3RIS        reg32(0x50038014)
#define R_GPIO3MIS        reg32(0x50038018)
#define R_GPIO3IC         reg32(0x5003801C)

#endif /* _REG_H_ */
